Repository: MemoOR/about-me
Catalog: web/app/translations/*/LC_MESSAGES/messages.po
Languages: es

source: Collect stars.
es: Obtén estrellas.

source: Avoid bombs.
es: Esquiva las bombas.

source: Spacebar, mousedown or touch to climb
es: Espacio, click o touch para subir

source: Game over
es: Fin del juego

source: PLAY
es: JUGAR

source: The email you entered is not valid
es: El correo electrónico que ingresaste no es válido

source: You didn't pass the captcha, try again
es: No pasaste la prueba captcha, inténtalo de nuevo

source: I got your message and will contact you soon!
es: Recibí tu mensaje y me pondré en contacto contigo pronto

source: Something went wrong
es: Algo salió mal

source: Not Found
es: No encontrado

source: The page you were looking for could not be found.
es: La página que buscabas no se pudo encontrar

source: Not Allowed
es: No permitido

source: You shouldn't try to do that.
es: No deberías intentar hacer eso

source: Server error
es: Error de servidor

source: Nothing is working right now
es: Parece que nada esta funcionando por ahora

source: Back To Home Page
es: Volver a la página de inicio

source: Menu
es: Menú

source: Home
es: Inicio

source: Dark view
es: Vista oscura

source: About Me
es: Acerca de mí

source: I hold a degree in Mechatronics Engineering from Universidad Iberoamericana, where I gained a strong foundation in interdisciplinary engineering principles. I seamlessly integrate hardware and software solutions to create innovative, multifaceted systems. I bring a wealth of expertise in Python programming, AWS cloud infrastructure, and efficient code deployment practices to my work.
es: Soy ingeniero en mecatrónica graduado de la Universidad Iberoamericana, donde adquirí una sólida base en principios de ingeniería interdisciplinaria. Integro de manera fluida soluciones de hardware y software para crear sistemas innovadores y multifacéticos. Aporto una gran experiencia en programación en Python, infraestructura en la nube de AWS y prácticas eficientes de implementación de código a mi trabajo.

source: My passion lies in merging machine learning with automotive technology, specifically focusing on enhancing autonomous vehicles. When I'm not immersed in my technical pursuits, I find tranquility in playing the piano and crafting with wood, balancing creativity and precision in my hobbies. Whether I'm exploring melodies on the piano or creating handmade furniture, I'm dedicated to continuous personal and professional growth.
es: Mi pasión se centra en fusionar el machine learning con la tecnología automotriz, centrándome específicamente en mejorar los vehículos autónomos. Cuando no estoy inmerso en mis actividades técnicas, encuentro tranquilidad en tocar el piano y trabajar la madera, equilibrando la creatividad y la precisión en mis pasatiempos. Ya sea explorando melodías en el piano o creando muebles hechos a mano, me dedico al crecimiento continuo personal y profesional.

source: Where to find me
es: Dónde encontrarme

source: Feel free to visit my LinkedIn and GitHub profiles to learn a little more about me
es: Siéntete libre de visitar mis perfiles de LinkedIn y GitHub para conocer un poco más acerca de mí

source: Github profile
es: Perfil de GitHub

source: LinkedIn profile
es: Perfil de LinkedIn

source: Contact Me
es: Contáctame

source: Hire me or get in touch with me if you need a project developed
es: Contrátame o ponte en contacto conmigo si necesitas desarrollar un proyecto

source: Get in touch
es: Ponte en contacto

source: Name
es: Nombre

source: Enter your name
es: Ingresa tu nombre

source: Email
es: Correo electrónico

source: Enter your email
es: Ingresa tu correo electrónico

source: Message
es: Mensaje

source: Enter your message
es: Ingresa tu mensaje

source: This site is protected by reCAPTCHA and the Google
es: Este sitio está protegido por reCAPTCHA y se aplican la

source: Privacy Policy
es: Política de privacidad

source: and
es: y

source: Terms of Service
es: Términos de servicio

source: apply.
es: de Google.

source: All the fields are required
es: Todos los campos son obligatorios

source: Submit Message
es: Enviar mensaje

source: "Light view"
es: "Vista clara"

source: "Dark view"
es: "Vista oscura"

source: All rights reserved
es: Todos los derechos reservados

source: Scroll to top
es: Desplazarse hasta arriba

source: DevOps Engineer
es: Ingeniero DevOps

source: /3dworld
es: /mundo3d

source: Play a game
es: Juega un juego

source: Explore the page
es: Explora la página

source: Scroll to the next section
es: Desplázate a la siguiente sección

source: Loading...
es: Cargando...

source: About
es: Acerca de mí

source: Resume
es: Currículum

source: Portfolio
es: Portafolio

source: Contact
es: Contacto

source: Take a look at some projects i have worked on
es: Echa un vistazo a algunos proyectos en los que he trabajado

source: All projects
es: Todos los proyectos

source: In collaboration with a partner we developed an IoT based smart terrarium application for precise terrarium management.
es: En colaboración con un socio, desarrollamos una aplicación de terrario inteligente basada en IoT para el manejo preciso del terrario.

source: Click to learn more
es: Haz clic para obtener más información

source: Robomaster programming
es: Programación de Robomaster

source: Used trajectory generation algorithms programmed in python to move the DJI robomaster across multiple fields with obstacles.
es: Utilicé algoritmos de generación de trayectorias programados en Python para mover el Robomaster de DJI a través de varios campos con obstáculos.

source: Smart Blinds
es: Persianas Inteligentes

source: I designed, developed and built an IoT device compatible with Alexa, enabling precise control of my bedroom blinds.
es: Diseñé, desarrollé y construí un dispositivo IoT compatible con Alexa, que permite el control preciso de las persianas de mi habitación.

source: GD-code web page
es: Página web de GD-code

source: Comming soon
es: Próximamente

source: A real state web app to help people find their dream home, rent or sales.
es: Una aplicación web de bienes raíces para ayudar a las personas a encontrar la casa de sus sueños, renta o venta.

source: Comming Soon
es: Próximamente

source: 1password Library
es: Biblioteca de 1password

source: I created an in-house library enabling employees to securely share secrets using 1Password app, significantly enhancing automation within our IT department streamlining various internal tasks.
es: Creé una biblioteca interna que permite a los empleados compartir seguramente secretos utilizando la aplicación 1Password, mejorando significativamente la automatización dentro de nuestro departamento de TI y simplificando diversas tareas internas.

source: Data Warehouse
es: Almacén de Datos - "Data Warehouse"

source: Automated infrastructure deployment for an AWS Redshift data warehouse using Terraform and Python adhering to internal security and compliance best practices.
es: Implementé y automaticé el despliegue de la infraestructura para un almacén de datos AWS Redshift utilizando Terraform y Python, siguiendo las mejores prácticas internas de seguridad de datos.

source: Implemented a Blue-Green deployment strategy for AWS SageMaker endpoints hosting machine learning models, transforming a 30-minute downtime during updates into zero downtime.
es: Implementé una estrategia Blue-Green para endpoints de AWS SageMaker que alojan modelos de machine learning, logrando eliminar completamente un tiempo de inactividad de 30 minutos en el servicio durante las actualizaciones.

source: Baby crawling aid
es: Ayudante para Gatear

source: I collaborated with a partner to design and build a device aimed at assisting children with intellectual disabilities in their crawling journey.
es: Colaboré con un compañero para diseñar y construir un dispositivo destinado a ayudar a niños con discapacidades intelectuales en su proceso de gateo.

source: Education and professional experience
es: Educación y experiencia profesional

source: Education
es: Educación

source: Udemy Certification
es: Certificación de Udemy

source: Completed a DevOps course with a focus on AWS and Kubernetes, significantly improving my skills and deepening my understanding of industry best practices.
es: Completé un curso de DevOps con enfoque en AWS y Kubernetes, mejorando significativamente mis habilidades y profundizando mi comprensión de las mejores prácticas de la industria.

source: Certificate
es: Certificado

source: Learned how to write JavaScript code to create 3D games using the WebGL library, Three JS.
es: Aprendí a escribir código JavaScript para crear juegos 3D utilizando la biblioteca WebGL, Three JS.

source: IELTS English Certification - C1
es: Certificación de Inglés IELTS - C1

source: English level: Full professional proficiency
es: Nivel de inglés: Competencia profesional completa

source: Mechatronics Engineering
es: Ingeniería en Mecatrónica y producción

source: Aug/2017 - Dec/2022
es: Ago/2017 - Dic/2022

source: Bachelor's Degree
es: Licenciatura

source: Ibero Webpage
es: Página web de Ibero

source: Experience
es: Experiencia

source: Senior Cloud Engineer
es: Ingeniero de nube Senior

source: Apr/2024 - Present
es: Abr/2020 - Actualidad

source: As a Senior Cloud Engineer, I automate the creation and management of Amazon Machine Images (AMIs) for internal use, develop internal applications, and build automation solutions to enhance employee productivity. I utilize tools like AWS, Azure, Cloudformation, Bicep, Terraform, and Python to streamline processes, manage cloud infrastructure, and improve operational efficiency.
es: Como ingeniero senior de la nube, automatizo la creación y gestión de Amazon Machine Images AMIs para uso interno, desarrollo aplicaciones internas y construyo soluciones de automatización para mejorar la productividad de los empleados. Utilizo herramientas como AWS, Azure, Cloudformation, Bicep, Terraform y Python para agilizar procesos, gestionar la infraestructura de la nube y mejorar la eficiencia operativa.

source: Thomson Reuters Webpage
es: Página web de Thomson Reuters

source: Sep/2022 - Apr/2024
es: Sep/2022 - Abr/2024

source: As a DevOps engineer, I develop tools to automate company processes using Python and Bash. I also create infrastructure for new development and production environments with Terraform, update automation scripts for technologies like Kubernetes, Docker, AWS, and Django, and integrate third-party services via APIs. My work enhances resource management and streamlines application deployment in our organization.
es: Como ingeniero DevOps, desarrollo herramientas para automatizar procesos empresariales utilizando Python y Bash. También creo infraestructura para nuevos entornos de desarrollo y producción con Terraform, actualizo scripts de automatización para tecnologías como Kubernetes, Docker, AWS y Django, e integro servicios de terceros a través de APIs. Mi trabajo mejora la gestión de recursos y optimiza la implementación de aplicaciones en nuestra organización.

source: Espressive Webpage
es: Página web de Espressive

source: Control Systems python developer
es: Desarrollador de Python para Sistemas de Control

source: Aug/2021 - Jan/2023
es: Ago/2021 - Ene/2023

source: I took the lead in designing and developing a self-driving two-wheeled vehicle, using Python, ROS 2, and C++ to implement artificial intelligence. This project involved integrating hardware and software systems and crafting control and navigation algorithms, marking a notable achievement in the field of robotics.
es: Me encargué de diseñar y desarrollar un vehículo autónomo de dos ruedas, utilizando Python, ROS 2 y C++, para implementar inteligencia artificial. Este proyecto involucró la integración de hardware y sistemas de software, así como la creación de algoritmos de control y navegación, marcando un logro notable en el campo de la robótica.

source: INIAT Webpage
es: Página web de INIAT

source: Software and Hardware Developer
es: Desarrollador de Software y Hardware

source: May/2020 - Present
es: May/2020 - Actualidad

source: Comprehensive service delivery encompassing web application development and maintenance using Flask and Django, as well as the creation of desktop applications in Python. I also design and develop REST APIs using Flask and AWS Lambda, and I am involved in creating embedded hardware solutions. This experience provides me with a holistic perspective in delivering technology projects spanning a variety of platforms and technologies.
es: Ofrezco servicios integrales que abarcan el desarrollo y mantenimiento de aplicaciones web utilizando Flask y Django, así como la creación de aplicaciones de escritorio en Python. También diseño y desarrollo APIs REST utilizando Flask y AWS Lambda, y estoy involucrado en la creación de soluciones de hardware integrado. Esta experiencia me proporciona una perspectiva holística en la entrega de proyectos tecnológicos que abarcan una variedad de plataformas y tecnologías.

source: Learn More
es: Más información

source: Computer Teacher
es: Profesor de Informática

source: Jan/2018 - May/2018
es: Ene/2018 - May/2018

source: I supervised and taught a total of nine groups, consisting of six elementary school groups and three preschool groups. My responsibilities included planning and implementing educational programs tailored to various age levels.
es: Supervisé y enseñé a un total de nueve grupos, que consistían en seis grupos de escuela primaria y tres grupos de preescolar. Mis responsabilidades incluyeron la planificación e implementación de programas educativos adaptados a diversos niveles de edad.

source: Feeling interested?
es: ¿Interesado?

source: View or download my CV in PDF
es: Ve o descarga mi CV en PDF

source: View
es: Ver

source: Download
es: Descargar

source: Skip to Content
es: Ir al Contenido
